### Step:1 Import Packages <---

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Step:2 Read the Visa data  ###

In [4]:
#filepath = filelocation+filename+extension
filepath1 = "C:\\Data Science\\Data Science Nareshit\\EDA datasets\\visadataset.csv"
pd.read_csv(filepath1)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

### Read the Bank DataSet ###

filepath2 = "C:\\Data Science\\Data Science Nareshit\\EDA datasets\\banking.csv"
pd.read_csv(filepath2)

## Step:3 Create a dataframe using lists

In [10]:
list1 = ["Ram","Raheem","Robert"]
list2 = [30,31,32]
cols = ['Name','Age']
names=pd.DataFrame(zip(list1,list2),columns=cols)
names

     Name  Age
0     Ram   30
1  Raheem   31
2  Robert   32

## Step:4 How to Save the dataframe in local

In [12]:
names.to_csv("C:\\Data Science\\Data Science Nareshit\\EDA datasets\\namesdatasets.csv")

In [14]:
names.to_csv("namesdatasets.csv")
#this will save where our python file located

In [16]:
names.to_csv("C:\\Data Science\\Data Science Nareshit\\EDA datasets\\namesdatasets1.csv",index=False)
# it will not create extra column as index

## task -1 : read namesdatasets and namesdatasets1

In [18]:
import os

In [21]:
file = open("C:\\Data Science\\Data Science Nareshit\\EDA datasets\\namesdatasets.csv",encoding="utf-8-sig")
file

In [22]:
filepath1 = "namesdatasets.csv"
pd.read_csv(filepath1)

##How to remove unnamed : 0

   Unnamed: 0    Name  Age
0           0     Ram   30
1           1  Raheem   31
2           2  Robert   32

In [23]:
filepath2 = "namesdatasets1.csv"
pd.read_csv(filepath2)

     Name  Age
0     Ram   30
1  Raheem   31
2  Robert   32

In [24]:
names

     Name  Age
0     Ram   30
1  Raheem   31
2  Robert   32

In [26]:
names['city'] = ['Hyd','Chennai','Banglore']
names

     Name  Age      city
0     Ram   30       Hyd
1  Raheem   31   Chennai
2  Robert   32  Banglore

In [29]:
pd.read_csv("namesdatasets.csv")

   Unnamed: 0    Name  Age
0           0     Ram   30
1           1  Raheem   31
2           2  Robert   32

In [34]:
names.to_csv("namesdatasets.csv")
names.to_csv("namesdatasets1.csv")

In [31]:
names

     Name  Age      city
0     Ram   30       Hyd
1  Raheem   31   Chennai
2  Robert   32  Banglore

In [33]:
pd.read_csv("namesdatasets1.csv")

     Name  Age
0     Ram   30
1  Raheem   31
2  Robert   32

In [40]:
pd.read_csv("namesdatasets.csv")

   Unnamed: 0    Name  Age      city
0           0     Ram   30       Hyd
1           1  Raheem   31   Chennai
2           2  Robert   32  Banglore

In [41]:
names.drop('city',axis=1,inplace=True)

In [42]:
names

     Name  Age
0     Ram   30
1  Raheem   31
2  Robert   32

In [9]:
dict1 = {'Names':['Ram','Rahim','Robert'],'Age':[20,21,22]}
dict1

{'Names': ['Ram', 'Rahim', 'Robert'], 'Age': [20, 21, 22]}

In [12]:
pd.DataFrame(dict1,columns=['Names','Age'],index=['A','B','C'])

    Names  Age
A     Ram   20
B   Rahim   21
C  Robert   22

In [17]:
list1 = ['Ram','Rahim','Robert']
list2 = [30,31,32]
cols = ['Name','age']
names = pd.DataFrame(zip(list1,list2),columns= cols,index=['A','B','C'])
names

     Name  age
A     Ram   30
B   Rahim   31
C  Robert   32